[
  {
    "id": 7,
    "title": "Universo de Leyes",
    "image": "/ProjectImages/UOL.png",
    "description": "The \"Universo de Leyes\" initiative is my longest-running project, focused on creating a system that facilitates the exploration of legal knowledge within the Mexican domain. This endeavor has spanned from fundamental information extraction to the application of advanced NLP techniques and has fundamentally shaped my academic and career aspirations. Initially conceived as an overly-engineered citation manager, the project has since evolved, leading to a publication, a second paper in progress, and is the likely subject of my undergraduate thesis.\n\nThe project is built on two core foundations:\n\n- Information Extraction: Automating the extraction and organization of text from Mexican legal documents.\n- Interactive Visualization: Developing intuitive software that simplifies legal case creation by clearly displaying referential connections between laws.\n\nCurrently, I am exploring the application of graph analysis to uncover insights into the evolution of law formation in Mexico over time, utilizing both text-based and graph-based embeddings to develop a robust and insightful system.",
    "category": "NLP",
    "scope": "Massive",
    "motivation": "Research",
    "years": "2023 - Present",
    "skills": ["NLP", "Information Extraction", "Graph Analysis", "Text Embeddings"],
    "status": "Active",
    "githubUrl": null,
    "liveUrl": null,
    "publications": [
      "Valdés, F., Gomar, R. H., & Méndez, D. A. (2025). Comparative Analysis of Information Extraction Techniques in the Mexican Legal System. In Information Technology and Systems, ICITS 2025, Volume 3, Conference proceedings, Lecture Notes in Networks and Systems.",
      "\"Universo de Leyes: Aplicando el Procesamiento del Lenguaje Natural para vincular textos jurídicos con un enfoque integral\" at Seminario de Ingeniería de Software y Sus Implicaciones, Facultad de Ciencias, UNAM (Nov 2024).",
      "\"Universo de Leyes...\" at Seminario Recursivo, División Académica de Ciencias de la Computación, ITAM (Mar 2024)."
    ]
  },
  {
    "id": 8,
    "title": "Agentic Car Catalogue Formatting",
    "image": "/ProjectImages/WIP.png",
    "description": "As a component of a larger initiative focused on sustainable automotive part replacements in Mexico, this project aimed to create a three-agent LLM system. Inspired by the TEXT2DB \"Observer-Analyzer-Coder\" framework, the system was designed to automatically generate and refine Python Pandas code to clean, structure, and homogenize diverse car part catalogues. The catalogues were initially digitized from physical copies using Camelot and various OCR tools.\n\nThe project achieved several successful cases where previously unseen catalogues were correctly formatted without human intervention. However, out of 10 different brand catalogues tested, only 4 were formatted correctly. The project is currently on hold, with plans to resume when open-source models become more powerful and capable of handling the lack of consistent structural patterns found across different manufacturers' catalogues.",
    "category": "NLP",
    "scope": "Medium",
    "motivation": "Makers",
    "years": "2024 - 2025",
    "skills": ["LLMs", "Agentic AI", "Python", "Pandas", "Camelot", "OCR"],
    "status": "Active",
    "githubUrl": null,
    "liveUrl": null,
    "presentations": [
      "Presented at the Centro ITAM para Datos + Algoritmos + Sociedad annual project presentation in 2024 and 2025."
    ]
  },
  {
    "id": 9,
    "title": "Ethics Survey Answer Clustering",
    "image": "/ProjectImages/WIP.png",
    "description": "This project aims to quantify and analyze differences in survey answers from over 200 ethics class tutors in Mexico City. The tutors each answered a survey of 10 open-ended questions. To aid investigators in finding correlations between tutor responses and the subsequent performance of their students, this project seeks to develop an automated method for grouping and clustering the textual answers, uncovering underlying patterns and themes.",
    "category": "NLP",
    "scope": "Small",
    "motivation": "Makers",
    "years": "2025 - Present",
    "skills": ["Python", "Spacy", "NLTK", "Clustering", "LLM", "Embeddings"],
    "status": "Active",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 10,
    "title": "Futbol Transformer",
    "image": "/ProjectImages/WIP.png",
    "description": "A personal project undertaken with the pedagogical goal of deeply exploring the transformer architecture. The core idea is to treat football (soccer) players and their on-field actions as words and sentences. By applying NLP techniques, I aim to predict which player will make the next move in a sequence and, hopefully, discover real-world tactical knowledge embedded within the model's results. This project is currently in progress.",
    "category": "NLP",
    "scope": "Small",
    "motivation": "Personal",
    "years": "2025 - Present",
    "skills": ["Python", "Transformers", "NLP"],
    "status": "Active",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 11,
    "title": "COSMIC NLP Automation",
    "image": "/ProjectImages/WIP.png",
    "description": "During two internships at Spingere, I was tasked with creating a prototype of an NLP system to automatically extract COSMIC software functional size estimation points from written project requirement documents. My role involved the complete research, planning, and prototyping of the solution. I organized and coordinated meetings with leading NLP specialists in Mexico to facilitate knowledge exchange.\n\nThe technical approach involved extracting actionable subject-verb-object triplets from the documents and training a Named Entity Recognition (NER) model to categorize the verbs based on real COSMIC data. The initial exploration yielded an F-score of 60% compared to expert human analysis, which was deemed promising enough for the company to pursue further internal development.",
    "category": "NLP",
    "scope": "Medium",
    "motivation": "Job",
    "years": "Summer & Winter 2022",
    "skills": ["Python", "Spacy", "NER", "Grammatical Extraction"],
    "status": "Inactive",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 12,
    "title": "ANTAD Pharmacy Site Recommendation",
    "image": "/ProjectImages/WIP.png",
    "description": "This project was developed for the 2024 ITAM Datathon, where it secured a finalist position among the top 6 teams out of 54. The objective was to use machine learning models, trained on data from high-performing pharmacies, to identify strategic locations for new store openings. This involved a comparative analysis of regional economic indicators to inform the site selection process. By analyzing open data from INEGI and considering key economic and demographic variables, we strategically selected municipalities for expansion.\n\nKey Results:\n- Model Performance: The prediction model, trained on 1,375 data points with 45 input variables, achieved an R² Score of 0.9677 and an RMSE of 23.2862, optimized using XGBoost.\n- Market Analysis: Analyzed 1,156 municipalities, identifying 441 as high-potential.\n- Strategic Recommendation: Recommended 46 municipalities across 20 states for new pharmacy openings, representing a potential market value of 1.33 billion pesos.",
    "category": "Data",
    "scope": "Medium",
    "motivation": "Competition",
    "years": "2024",
    "skills": ["Python", "XGBoost", "Machine Learning", "Data Analysis"],
    "status": "Inactive",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 13,
    "title": "Gol Tempranero",
    "image": "/ProjectImages/WIP.png",
    "description": "Developed for the Hackathon Football Analytics ITAM 2024, this project earned a finalist spot among the top 5 teams out of 120. The project investigated whether early goals in football matches are a result of specific, repeatable strategies or merely luck. By analyzing 333 matches with early goals across competitions like the Bundesliga, Champions League, and Copa América, we found that the scoring team achieved a win or draw in 69.3% of cases.\n\nUsing StatsBomb event data, we generated and classified play sequences leading to early goals, analyzing variables like pass height, length, and type. The K-Means algorithm was applied to identify recurring tactical patterns, revealing that different leagues and teams employ distinct strategies to score early. The analysis concluded that while early goals significantly impact results, they necessitate specific strategic planning.",
    "category": "Data",
    "scope": "Small",
    "motivation": "Competition",
    "years": "2024",
    "skills": ["Python", "K-Means", "Regression", "StatsBomb"],
    "status": "Inactive",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 14,
    "title": "SEMOVI Public Transport Route Digitization",
    "image": "/ProjectImages/WIP.png",
    "description": "This project involved building an automated system for SEMOVI (Mexico City's Secretariat of Mobility) to digitalize written public transport routes from official scanned documents. I developed an image processing pipeline to extract route information and utilized street names cross-referenced with OpenStreetMap data to generate accurate, digital route maps. I am currently authoring a paper to showcase the system, the algorithmic approach, and the process used to successfully digitalize these physical records.",
    "category": "Data",
    "scope": "Large",
    "motivation": "Makers",
    "years": "2023 - 2025",
    "skills": ["Python", "Computer Vision", "OCR", "OpenStreetMap API"],
    "status": "Active",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 15,
    "title": "Repuestos Sustentables",
    "image": "/ProjectImages/WIP.png",
    "description": "In collaboration with InvierteSustentable and JetzApp, this project explores the use of information extraction to promote sustainability in the automotive industry by providing consumers with alternative, eco-friendly car part options. We are authoring a paper that examines the current state of open-source multimodal information extraction through the lens of this domain-specific task.\n\nKey Activities:\n- Experimenting with LLM-based agents to dynamically generate fine-tuned Python functions that adapt to the varying data structures of different part catalogues.\n- Developing a categorization method to identify and group common characteristics across catalogues.\n- Building a prototype to manage a database of over 300 cars, tracking the status of their parts and storing information on possible sustainable repair options.",
    "category": "Data",
    "scope": "Large",
    "motivation": "Makers",
    "years": "2024 - Present",
    "skills": ["LLM Agents", "Python", "Information Extraction"],
    "status": "Active",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 16,
    "title": "ATM Location & Transaction Prediction System",
    "image": "/ProjectImages/WIP.png",
    "description": "Serving as the full-stack ML engineer for this project with BanCoppel, I developed a system to recommend optimal locations for new ATMs. The project involved creating a comprehensive spatial database, a backend API, and a frontend visualization tool. The data pipeline I constructed produced what is likely the most robust ATM database in Mexico, containing over 12,000 ATMs with monthly transaction data from four different banks.\n\nModels & Outcomes:\n- A location model that predicts the number of ATMs required in a given municipality with an R² of 0.92.\n- A transaction model that predicts the monthly transaction volume of an ATM with an R² of 0.60.\nThe system was used to identify 30 new high-potential locations for BanCoppel ATMs, with each recommendation closely matching those made by human experts in the field.",
    "category": "Software",
    "scope": "Large",
    "motivation": "Job",
    "years": "2025 - Present",
    "skills": ["PostgreSQL", "PostGIS", "Node.js", "React", "Deck.gl", "XGBoost"],
    "status": "Active",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 17,
    "title": "El Critón Interactivo",
    "image": "/ProjectImages/WIP.png",
    "description": "I created a comprehensive and interactive digital interpretation of Plato’s dialogue \"Crito\" to serve as an engaging educational resource for first-semester students in the \"Ideas e Instituciones Políticas I\" course at ITAM. A narrative closely based on the source text was designed, applying game design principles to enhance content interaction and information recall. A use-case-specific dialogue system was built from the ground up using Angular.",
    "category": "Software",
    "scope": "Medium",
    "motivation": "Personal",
    "years": "2023 - 2024",
    "skills": ["Angular", "TypeScript"],
    "status": "Inactive",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 18,
    "title": "Space Train",
    "image": "/ProjectImages/WIP.png",
    "description": "A personal website that serves as my professional portfolio and a creative outlet. Conceived more as a continuous journey than a final product, this project has been instrumental in helping me learn and refine a variety of web development and design skills.",
    "category": "Software",
    "scope": "Medium",
    "motivation": "Personal",
    "years": "2023 - Present",
    "skills": ["Web Development"],
    "status": "Active",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 19,
    "title": "CASAPP",
    "image": "/ProjectImages/WIP.png",
    "description": "My first significant software development project. I built a robust Angular website for my high school classmates to keep track of their CAS (Creativity, Activity, Service) activities for the IB program. The application featured user authentication, image uploading, and a complete activity management system, all built on a Firebase backend.",
    "category": "Software",
    "scope": "Medium",
    "motivation": "Personal",
    "years": "2020 - 2022",
    "skills": ["Angular", "Firebase"],
    "status": "Inactive",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 20,
    "title": "Datodos",
    "image": "/ProjectImages/WIP.png",
    "description": "A website launched during the COVID-19 pandemic to facilitate the donation of cellular data to underprivileged students who lacked home internet access for their online classes. The initiative successfully raised 2,000 pesos, providing five students with enough internet access to attend their classes for three months.",
    "category": "Software",
    "scope": "Medium",
    "motivation": "Personal",
    "years": "2021 - 2022",
    "skills": ["Angular", "Firebase"],
    "status": "Inactive",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 21,
    "title": "AuthentiQR",
    "image": "/ProjectImages/WIP.png",
    "description": "An Android application built for the ITAM 2023 Hackathon. In the post-COVID era of QR-code menus, this app provides a layer of security by allowing a user to scan a QR code and check its destination link against various security APIs and databases to ensure it is not malicious. The project won first place in the competition.",
    "category": "Software",
    "scope": "Medium",
    "motivation": "Competition",
    "years": "2023",
    "skills": ["Android", "Java/Kotlin", "Security APIs"],
    "status": "Inactive",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 22,
    "title": "Latent Lull",
    "image": "/ProjectImages/WIP.png",
    "description": "My passion project: a video game currently in development.",
    "category": "Software",
    "scope": "Massive",
    "motivation": "Personal",
    "years": "Ongoing",
    "skills": ["Unity", "C#", "Blender"],
    "status": "Active",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 23,
    "title": "Ultimate Tic-Tac-Toe AI",
    "image": "/ProjectImages/WIP.png",
    "description": "A project for my 5th-semester Artificial Intelligence class. I built an Ultimate Tic-Tac-Toe game engine and an AI opponent. The AI's board evaluation function is powered by a neural network, which feeds into a foundational Minimax algorithm with alpha-beta pruning. I personally cannot beat it.",
    "category": "Software",
    "scope": "Small",
    "motivation": "Academic",
    "years": "2024",
    "skills": ["Python", "Neural Networks", "Minimax"],
    "status": "Inactive",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 24,
    "title": "La Baldosa de Hisarlik",
    "image": "/ProjectImages/WIP.png",
    "description": "A Unity-based interactive experience inspired by an animation I created in OpenGL. The project is based on a specific story from Homer's Iliad—the Trojan Horse—but with the narrative constraint of telling the story through the visuals found on a single, unearthed archaeological tile.",
    "category": "Software",
    "scope": "Medium",
    "motivation": "Academic",
    "years": "2023-2024",
    "skills": ["Unity", "Blender", "OpenGL", "C#"],
    "status": "Inactive",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 25,
    "title": "Mara Triangle Safari Route Simulation",
    "image": "/ProjectImages/WIP.png",
    "description": "A rule-based agent simulation of 15 different animal species found in the Mara Triangle. The simulation was constructed to test what effect safari vehicles following designated routes have on the animal population's behavior and distribution.",
    "category": "Software",
    "scope": "Small",
    "motivation": "Academic",
    "years": "2024",
    "skills": ["Python", "Agent-Based Simulation"],
    "status": "Inactive",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 26,
    "title": "Sense It",
    "image": "/ProjectImages/WIP.png",
    "description": "For my Principles of Mechatronics class, I built a \"Bop It\" style game from scratch. The project involved writing 2,500 lines of AVR assembly code to control the game logic. It incorporated three analogue sensors and two digital sensors, an Arduino as an analogue-to-digital converter, and utilized AVR timers, delays, and PWM for audio-visual feedback. A 7-segment digital display system shows the score. The game randomly selects a sensor, and the player must interact with it in time, with the time limit decreasing as the game progresses. The toy was designed and constructed from 3d laser cut parts designed using SolidWorks.",
    "category": "Hardware",
    "scope": "Medium",
    "motivation": "Academic",
    "years": "2025",
    "skills": ["AVR Assembly", "Arduino", "PWM", "Sensors", "CAD"],
    "status": "Inactive",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 27,
    "title": "Basic CPU from Logic Gates",
    "image": "/ProjectImages/WIP.png",
    "description": "Using the Quartus design software, I built a functional CPU from basic logic gates. The system is capable of performing 8-bit addition, subtraction, and multiplication. The design included a datapath, memory path, program counter, and an arithmetic logic unit (ALU). The final CPU was connected to a breadboard with analogue inputs and a 4-digit, 7-segment display for output.",
    "category": "Hardware",
    "scope": "Medium",
    "motivation": "Academic",
    "years": "2024",
    "skills": ["Quartus", "Digital Logic Design"],
    "status": "Inactive",
    "githubUrl": null,
    "liveUrl": null
  },
  {
    "id": 28,
    "title": "3D Scanning Course",
    "image": "/ProjectImages/WIP.png",
    "description": "For two semesters, I served as the lead 3D scanner in the maker lab's design team. In this role, I taught a class of 12 students how to effectively use the CR Lizard 3D scanner to scan functional parts and subsequently replicate or modify them using SolidWorks.",
    "category": "Hardware",
    "scope": "Medium",
    "motivation": "Makers",
    "years": "2022 - 2023",
    "skills": ["3D Scanning", "SolidWorks"],
    "status": "Inactive",
    "githubUrl": null,
    "liveUrl": null
  }
]